{
  "academicExperiences": [
    {
      "id": "university-tokyo",
      "title": "The University of Tokyo",
      "description": "Internship: Embedded systems, data analysis and machine learning",
      "period": "April 2025 - July 2025",
      "location": "Tokyo - Japan",
      "fullDescription": "3 month research internship at the DLX design lab of the University of Tokyo where I had the opportunity of working with an international team of researchers and workers on two different projects. CoralRescue, an innovative aquarium made to collect damaged coral connected to sensors that sends data to a web app. I created better data visualization interfaces as well as training machine learning models on the historical data to help the users with hourly anomaly alerts and to give quality score to the days of data. And also AiCOM which is a project of making an image guessing game where two players compete against OpenAI GPT-4 API, the goal being to collect data for use case's where LLM's canno't understands information that an human can understand. I made an entire full stack website to make the game as well as implementing the game mechanics for 3 different gamemodes.",
      "skillsGained": [
        "Embedded Systems Programming",
        "Machine Learning Implementation",
        "Data Analysis and Visualization",
        "IoT Protocol Implementation",
        "Cross-cultural Communication",
        "Research Methodology "
      ],
      "link": "../assets/InternshipReport.pdf",
      "reference": "../assets/UTokyoReference.pdf",
      "photos": [
        {
          "src": "../../assets/TrackPhotos/Tokyo1.jpg",
          "description": "Making test with the sensors of the CoralRescue aquarium"
        },
        {
          "src": "../../assets/TrackPhotos/Tokyo2.jpg",
          "description": "Presenting the AiCOM game to the yearly open campus of the University of Tokyo"  
        },
        {
          "src": "../../assets/TrackPhotos/Tokyo.jpg",
          "description": "Giving a tour to french highschool students visiting the University of Tokyo for the open campus"
        }
      ]
    },
    {
      "id": "assopena-president",
      "title": "President of l'Assopeña",
      "description": "President of the student association of my University",
      "period": "2024 - 2025",
      "location": "Bordeaux - France",
      "fullDescription": "I was elected among 300 students to be the president of the student association of my department. I was in charge of managing a team of 10 association members, organizing events, selling snacks to student at the bar of the association, manage a budget of thousands of euros aswell as integrating the new students and handling the communication between students and administration.",
      "skillsGained": [
        "Leadership and Team Management",
        "Budget Management and Financial Planning",
        "Event Planning and Organization",
        "Public Speaking and Presentation",
        "Communication between Students and Administration"
      ],
      "link": "",
      "reference": "",
      "photos": [
        {
          "src": "../../assets/TrackPhotos/BDE.jpg",
          "description": "Crêpes event to collect money for the 'Téléthon', a french caricative association helping the research agaisnt cancer"
        },
        {
          "src": "../../assets/TrackPhotos/BDE1.png",
          "description": "Welcome speech at the beginning of the academic year for the new students"
        },
        {
          "src": "../../assets/TrackPhotos/BDE2.png",
          "description": "The whole team of the association"
        }
      ]
    },
    {
      "id": "iut-bordeaux",
      "title": "University of Bordeaux, IUT Bordeaux",
      "description": "Bachelor degree: Bachelor of Computer Science, International track",
      "period": "2023 - 2026",
      "location": "Bordeaux - France",
      "fullDescription": "Pursuing a Bachelor's degree (BUT) in Computer Science at the University of Bordeaux, the lessons taught range from a wide variety of subjects from web development to data-science and algorithmics. One of the strong points of the formation is that frequency of team projets that we have to complete with other students randomly assigned, teaching us to work as a team in a concrete environment. I also follow the international track of the degree with classes of computer science and mathematics in English as well as requiring an internship abroad which I completed in Japan, this really taught me how to work in a technical and internatonal environment",
      "skillsGained": [
        "Software Development",
        "Algorithm Design and Analysis",
        "Database Design and Management",
        "Web Development",
        "Object-Oriented Programming",
        "Team collaboration"
      ],
       "link": "",
       "reference": "",
      "photos": [
        {
          "src": "../../assets/TrackPhotos/IUT.jpeg",
          "description": "IUT Bordeaux computer science department"
        },
        {
          "src": "../../assets/TrackPhotos/IUT1.jpg",
          "description": "Brainstorming fora school project"
        },
        {
          "src": "../../assets/TrackPhotos/IUT2.jpg",
          "description": "With my team after a successful final project presentation"
        }
      ]
    }
  ]
}